config/Documents/ЗакрытиеЗявкиНаОптовуюОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗакрытиеЗявкиНаОптовуюОтгрузку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаявкаНаОптовуюОтгрузку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаОптовуюОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗакупБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодТовара</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/AccumulationRegisters/ЗаявкаНаОптовуюОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаявкаНаОптовуюОтгрузку</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаОптовуюОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/Documents/ЗакрытиеЗявкиНаОптовуюОтгрузку/Ext/ObjectModule.bsl
Процедура ЗакрытьЗаявку(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Расход.КодТовара КАК КодТовара,
	               |	Расход.Товар КАК Товар,
	               |	СУММА(Расход.Количество) КАК Количество,
	               |	СУММА(Расход.СуммаЗакупБезНДС) КАК СуммаЗакупБезНДС
	               |ПОМЕСТИТЬ ДокТЧ
	               |ИЗ
	               |	Документ.ЗакрытиеЗявкиНаОптовуюОтгрузку.Товар КАК Расход
	               |ГДЕ
	               |	Расход.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Расход.КодТовара,
	               |	Расход.Товар
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДокТЧ.КодТовара КАК КодТовара,
	               |	ДокТЧ.Товар КАК Товар,
	               |	ДокТЧ.Количество КАК Количество,
	               |	ДокТЧ.СуммаЗакупБезНДС КАК СуммаЗакупБезНДС
	               |ИЗ
	               |	ДокТЧ КАК ДокТЧ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Движения.ЗаявкаНаОптовуюОтгрузку.Записывать = Истина;
	Выборка = РезультатЗапроса.Выбрать();
	КодКлиента = Клиент.Код;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ЗаявкаНаОптовуюОтгрузку.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.КодКлиента = КодКлиента;
		Движение.КодТовара = Выборка.КодТовара;
		Движение.Заявка = ДокументОснование;
		Движение.Количество = Выборка.Количество;
		Движение.СуммаЗакупБезНДС = Выборка.СуммаЗакупБезНДС;
	КонецЦикла; 
	Движения.Записать();
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегЗаявка.КодТовара КАК КодТовара,
	               |	РегЗаявка.КоличествоОстаток КАК Остаток
	               |ИЗ
	               |	РегистрНакопления.ЗаявкаНаОптовуюОтгрузку.Остатки(
	               |			,
	               |			КодТовара В
	               |					(ВЫБРАТЬ
	               |						ДокТЧ.КодТовара
	               |					ИЗ
	               |						ДокТЧ КАК ДокТЧ)
	               |				И Заявка = &Заявка) КАК РегЗаявка
	               |ГДЕ
	               |	РегЗаявка.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Заявка", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОст = РезультатЗапроса.Выбрать();
	Пока ВыборкаОст.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Превышение количества по коду  " + Формат(ВыборкаОст.КодТовара,"ЧГ=0") + " , после проведения документа остаток составит " + ВыборкаОст.Остаток;
		Сообщение.Сообщить();
		Отказ = Истина;        
	КонецЦикла; 
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЗакрытьЗаявку(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатаПоследнегоИзменения = ТекущаяДата();
	СуммаЗакупБезНДС = Товар.Итог("СуммаЗакупБезНДС");
	
	ОбщегоНазначения.ЗаписатьСменуСостоянияДокумента(Ссылка,РежимЗаписи,ПометкаУдаления);	
	
КонецПроцедуры
